In [6]:
import pandas as pd
titanic_train = pd.read_csv("train.csv")
titanic_train.head(6)

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [7]:
titanic_train["embarked"].describe()

count     889
unique      3
top         S
freq      644
Name: embarked, dtype: object

In [8]:
titanic_train["embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [11]:
embarked = titanic_train["embarked"]
list_embarked = pd.Categorical(embarked)
list_embarked.describe()

            counts     freqs
categories
C              168  0.188552
Q               77  0.086420
S              644  0.722783
NaN              2  0.002245

In [34]:
dead_survived = pd.Categorical(titanic_train["survived"])
dead_survived = dead_survived.rename_categories(["Dead","Survived"])
dead_survived.describe() #xem thống kê cơ bản như trung bình, phân vị, std,....

            counts     freqs
categories
Dead           549  0.616162
Survived       342  0.383838